tutorials/flowOverSphere/flowOverSphere/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 30;

vertices
(
    (-1 -1 -1)     //0
    (1 -1 -1)      //1
    (1 1 -1)       //2
    (-1 1 -1)      //3
    (-1 -1 1)  //4
    (1 -1 1)   //5
    (1 1 1)    //6
    (-1 1 1)   //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 30 30) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall top
    (
        (3 7 6 2)
    )
    wall inlet
    (
        (0 4 7 3)
    )
    wall outlet
    (
        (2 6 5 1)
    )
    wall bottom
    (
        (1 5 4 0)
    )
    wall back
    (
        (0 3 2 1)
    )
    wall front
    (
        (4 5 6 7)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
