tutorials/flowOverSphere/flowOverSphere/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            wall;
        nFaces          900;
        startFace       78300;
    }
    inlet
    {
        type            wall;
        nFaces          900;
        startFace       79200;
    }
    outlet
    {
        type            wall;
        nFaces          900;
        startFace       80100;
    }
    bottom
    {
        type            wall;
        nFaces          900;
        startFace       81000;
    }
    back
    {
        type            wall;
        nFaces          900;
        startFace       81900;
    }
    front
    {
        type            wall;
        nFaces          900;
        startFace       82800;
    }
)

// ************************************************************************* //
